evidence/mutation-controls-2026-08-23-fivemodule/octetA.diff
diff --git a/der-verified/src/octet_string.rs b/der-verified/src/octet_string.rs
index 0658fbd..1892bed 100644
--- a/der-verified/src/octet_string.rs
+++ b/der-verified/src/octet_string.rs
@@ -58,9 +58,9 @@ pub fn decode_octet_string(input: &[u8]) -> Result<(&[u8], usize), OctetStringEr
     if tlv.tag.class != Class::Universal || tlv.tag.number != TAG {
         return Err(OctetStringError::WrongTag);
     }
-    if tlv.tag.constructed {
-        return Err(OctetStringError::Constructed);
-    }
+    // if tlv.tag.constructed {
+    //     return Err(OctetStringError::Constructed);
+    // }
     Ok((tlv.value, used))
 }
 
